# St7SetLoadPathTemplateVehicleName

Sets the name of a vehicle in the specified load path template.

long St7SetLoadPathTemplateVehicleName(long uID, long TemplateID, long Vehicle,
char* VehicleName)
Input Parameters
uID
Strand7 model file ID.
TemplateID
Load path template ID.
Vehicle
Vehicle number.
VehicleName
Vehicle name.